open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_qspi.c
/****************************************************************************
 * chips/bk7258/ap/bk7258_qspi.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * BK7258 AP QSPI lower-half for the standard NuttX qspi_dev_s contract.
 *
 * The implementation uses only the public BK7258 SDK v3.1.1.9 QSPI API:
 * bk_qspi_driver_init(), bk_qspi_init(), bk_qspi_command(),
 * bk_qspi_read(), and bk_qspi_write().  It intentionally does not call the
 * SDK's chip-specific qspi_flash helpers, enable a Flash QE bit, or expose a
 * private character-device ABI.
 *
 * The SDK QSPI path is synchronous and polls command completion.  Its FIFO
 * helpers access 32-bit words and the official Flash helpers cap one
 * indirect operation at 256 bytes.  This lower-half stages unaligned or
 * short buffers and limits writes to that boundary.  Only read memory
 * windows may be issued as multiple independently addressed transactions.
 * qspi_ll_wait_cmd_done() only logs a hardware timeout and the public
 * bk_qspi_command() still returns BK_OK, so this wrapper cannot report that
 * hardware condition as -ETIMEDOUT.
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#ifdef CONFIG_BK7258_QSPI

#include <errno.h>
#include <stdbool.h>
#include <stddef.h>
#include <stdint.h>
#include <string.h>

#include <nuttx/kmalloc.h>
#include <nuttx/mutex.h>
#include <nuttx/spi/qspi.h>

#include <arch/chip/bk7258_qspi.h>

/* The v3.1.1.9 SDK bundle exports the QSPI data types, but its public
 * driver/qspi.h -> qspi_types.h include chain leaks the private qspi_hal.h
 * header, which is not shipped in the immutable bundle.  Keep this wrapper
 * on the exported types and declare only the five public ABI symbols it uses.
 * The symbols below are provided by the immutable libdriver.a; no SDK
 * implementation or private type is reproduced here.
 */

#include <common/bk_err.h>
#include <driver/hal/hal_qspi_types.h>

extern bk_err_t bk_qspi_driver_init(void);
extern bk_err_t bk_qspi_init(qspi_id_t id, const qspi_config_t *config);
extern bk_err_t bk_qspi_command(qspi_id_t id, const qspi_cmd_t *cmd);
extern bk_err_t bk_qspi_read(qspi_id_t id, void *data, uint32_t size);
extern bk_err_t bk_qspi_write(qspi_id_t id, const void *data, uint32_t size);

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* qspi_flash.c in the immutable SDK uses this FIFO transaction size. */

#define BK7258_QSPI_FIFO_BYTES          256u
#define BK7258_QSPI_WORD_BYTES          4u
#define BK7258_QSPI_ADDRESS_LIMIT       0x01000000u
#define BK7258_QSPI_ADDRESS_MASK        (BK7258_QSPI_ADDRESS_LIMIT - 1u)

/* qspi_hw_t exposes a 7-bit dummy-clock field and qspi_cmd_t carries an
 * opcode in an 8-bit hardware field, even though the public types are wider.
 */

#define BK7258_QSPI_DUMMY_MAX           0x7fu
#define BK7258_QSPI_OPCODE_MAX          0xffu

/* qspi_ll_init_command() has explicit no-address encodings for only these
 * Flash opcodes.  All other QSPI_FLASH indirect commands unconditionally
 * transmit three address bytes, regardless of qspi_cmd_t contents.
 */

#define BK7258_QSPI_CMD_READ_STATUS_0   0x05u
#define BK7258_QSPI_CMD_READ_STATUS_1   0x35u
#define BK7258_QSPI_CMD_READ_ID         0x9fu
#define BK7258_QSPI_CMD_WRITE_STATUS_0  0x01u
#define BK7258_QSPI_CMD_WRITE_STATUS_1  0x31u
#define BK7258_QSPI_CMD_WRITE_ENABLE    0x06u

/* qspi_types.h owns these values, but cannot be included from the bundle
 * because of its private qspi_hal.h dependency.  Keep the values board-owned
 * and derive them only from the public QSPI error base.
 */

#define BK7258_SDK_ERR_QSPI_NOT_INIT    (BK_ERR_QSPI_BASE - 1)
#define BK7258_SDK_ERR_QSPI_ID_NOT_INIT (BK_ERR_QSPI_BASE - 2)

/****************************************************************************
 * Private Types
 ****************************************************************************/

struct bk7258_qspi_priv_s
{
  struct qspi_dev_s dev;             /* NuttX-visible object */
  qspi_id_t         id;              /* BK7258 QSPI unit */
  uint32_t          frequency;       /* Fixed SDK configuration target */
  enum qspi_mode_e  mode;            /* Last NuttX mode request */
  int               bits;            /* Last NuttX bits request */
  bool              mode_valid;      /* SDK supports only mode 0 */
  bool              bits_valid;      /* SDK supports only 8 bits */
  bool              initialized;     /* bk_qspi_init() completed */
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

static int bk7258_qspi_lock(FAR struct qspi_dev_s *dev, bool lock);
static uint32_t bk7258_qspi_setfrequency(FAR struct qspi_dev_s *dev,
                                         uint32_t frequency);
static void bk7258_qspi_setmode(FAR struct qspi_dev_s *dev,
                                enum qspi_mode_e mode);
static void bk7258_qspi_setbits(FAR struct qspi_dev_s *dev, int nbits);
static int bk7258_qspi_command(FAR struct qspi_dev_s *dev,
                               FAR struct qspi_cmdinfo_s *cmdinfo);
static int bk7258_qspi_memory(FAR struct qspi_dev_s *dev,
                              FAR struct qspi_meminfo_s *meminfo);
static FAR void *bk7258_qspi_alloc(FAR struct qspi_dev_s *dev,
                                   size_t buflen);
static void bk7258_qspi_free(FAR struct qspi_dev_s *dev,
                             FAR void *buffer);

static int bk7258_qspi_map_error(bk_err_t error);
static void bk7258_qspi_invalidate_all(void);
static int bk7258_qspi_map_priv_error(
  FAR struct bk7258_qspi_priv_s *priv, bk_err_t error);
static int bk7258_qspi_validate_config(
  FAR const struct bk7258_qspi_priv_s *priv);
static int bk7258_qspi_init_locked(FAR struct bk7258_qspi_priv_s *priv);
static int bk7258_qspi_write_data(
                                  FAR struct bk7258_qspi_priv_s *priv,
                                  FAR const void *buffer,
                                  size_t buflen);
static int bk7258_qspi_read_data(
                                 FAR struct bk7258_qspi_priv_s *priv,
                                 FAR void *buffer,
                                 size_t buflen);
static bool bk7258_qspi_no_address_command(uint32_t opcode, bool read);
static bool bk7258_qspi_is_status_write(uint32_t opcode);
static int bk7258_qspi_validate_memory(FAR const struct qspi_meminfo_s *meminfo,
                                       qspi_wire_mode_t *wire_mode);

/****************************************************************************
 * Private Data
 ****************************************************************************/

/* The SDK's qspi_hal.c keeps operation state globally and exposes no bus
 * mutex.  One NuttX mutex therefore serializes both QSPI units and all
 * lower-half transactions.  SDK LCD/PSRAM users remain outside this lock;
 * the board integration must not run those clients concurrently without a
 * corresponding board-level ownership policy.
 */

static mutex_t g_bk7258_qspi_lock = NXMUTEX_INITIALIZER;

static const struct qspi_ops_s g_bk7258_qspi_ops =
{
  .lock         = bk7258_qspi_lock,
  .setfrequency = bk7258_qspi_setfrequency,
  .setmode      = bk7258_qspi_setmode,
  .setbits      = bk7258_qspi_setbits,
#ifdef CONFIG_QSPI_HWFEATURES
  .hwfeatures   = NULL,
#endif
  .command      = bk7258_qspi_command,
  .memory       = bk7258_qspi_memory,
  .alloc        = bk7258_qspi_alloc,
  .free         = bk7258_qspi_free,
};

static struct bk7258_qspi_priv_s g_bk7258_qspi[BK7258_QSPI_UNIT_COUNT] =
{
  {
    .dev          = { .ops = &g_bk7258_qspi_ops },
    .id           = (qspi_id_t)0,
    .frequency    = BK7258_QSPI_DEFAULT_FREQUENCY,
    .mode         = BK7258_QSPI_DEFAULT_MODE,
    .bits         = BK7258_QSPI_DEFAULT_BITS,
    .mode_valid   = (BK7258_QSPI_DEFAULT_MODE == QSPIDEV_MODE0),
    .bits_valid   = (BK7258_QSPI_DEFAULT_BITS == 8),
    .initialized  = false,
  },
  {
    .dev          = { .ops = &g_bk7258_qspi_ops },
    .id           = (qspi_id_t)1,
    .frequency    = BK7258_QSPI_DEFAULT_FREQUENCY,
    .mode         = BK7258_QSPI_DEFAULT_MODE,
    .bits         = BK7258_QSPI_DEFAULT_BITS,
    .mode_valid   = (BK7258_QSPI_DEFAULT_MODE == QSPIDEV_MODE0),
    .bits_valid   = (BK7258_QSPI_DEFAULT_BITS == 8),
    .initialized  = false,
  },
};

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: bk7258_qspi_map_error
 ****************************************************************************/

