open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_qspi.c
static int bk7258_qspi_map_error(bk_err_t error)
{
  if (error == BK_OK)
    {
      return OK;
    }

  switch (error)
    {
      case BK7258_SDK_ERR_QSPI_NOT_INIT:
      case BK7258_SDK_ERR_QSPI_ID_NOT_INIT:
      case BK_ERR_NOT_INIT:
      case BK_ERR_TRY_AGAIN:
        return -EAGAIN;

      case BK_ERR_NULL_PARAM:
      case BK_ERR_PARAM:
        return -EINVAL;

      case BK_ERR_BUSY:
        return -EBUSY;

      case BK_ERR_TIMEOUT:
        return -ETIMEDOUT;

      case BK_ERR_NO_MEM:
        return -ENOMEM;

      case BK_ERR_NOT_SUPPORT:
        return -ENOTSUP;

      case BK_ERR_IN_PROGRESS:
        return -EINPROGRESS;

      default:
        return -EIO;
    }
}

/****************************************************************************
 * Name: bk7258_qspi_invalidate_all
 ****************************************************************************/

static void bk7258_qspi_invalidate_all(void)
{
  unsigned int i;

  for (i = 0; i < BK7258_QSPI_UNIT_COUNT; i++)
    {
      g_bk7258_qspi[i].initialized = false;
    }
}

/****************************************************************************
 * Name: bk7258_qspi_map_priv_error
 ****************************************************************************/

static int bk7258_qspi_map_priv_error(
  FAR struct bk7258_qspi_priv_s *priv, bk_err_t error)
{
  /* The SDK exposes no ownership-safe query for its global or per-unit
   * state.  If another AP client deinitializes either layer, invalidate our
   * cached state so a later transfer or explicit bk7258_qspi_initialize() can
   * retry.
   */

  if (error == BK7258_SDK_ERR_QSPI_NOT_INIT)
    {
      /* A global SDK deinit invalidates every unit's cached state. */

      bk7258_qspi_invalidate_all();
    }
  else if (error == BK7258_SDK_ERR_QSPI_ID_NOT_INIT)
    {
      priv->initialized = false;
    }

  return bk7258_qspi_map_error(error);
}

/****************************************************************************
 * Name: bk7258_qspi_validate_config
 ****************************************************************************/

static int bk7258_qspi_validate_config(
  FAR const struct bk7258_qspi_priv_s *priv)
{
  if (!priv->mode_valid || !priv->bits_valid)
    {
      /* The public SDK has no runtime CPOL/CPHA or word-width setter. */

      return -ENOTSUP;
    }

  return OK;
}

/****************************************************************************
 * Name: bk7258_qspi_lock
 ****************************************************************************/

static int bk7258_qspi_lock(FAR struct qspi_dev_s *dev, bool lock)
{
  (void)dev;

  if (lock)
    {
      return nxmutex_lock(&g_bk7258_qspi_lock);
    }

  return nxmutex_unlock(&g_bk7258_qspi_lock);
}

/****************************************************************************
 * Name: bk7258_qspi_setfrequency
 ****************************************************************************/

static uint32_t bk7258_qspi_setfrequency(FAR struct qspi_dev_s *dev,
                                         uint32_t frequency)
{
  FAR struct bk7258_qspi_priv_s *priv =
    (FAR struct bk7258_qspi_priv_s *)dev;

  /* The public SDK has no runtime QSPI frequency setter.  bk_qspi_init()
   * uses the official generic Flash configuration (480M source, source
   * divider 4, controller divider 2), so preserve and report that fixed
   * target instead of claiming an unperformed reconfiguration.
   */

  (void)frequency;
  return priv->frequency;
}

/****************************************************************************
 * Name: bk7258_qspi_setmode
 ****************************************************************************/

static void bk7258_qspi_setmode(FAR struct qspi_dev_s *dev,
                                enum qspi_mode_e mode)
{
  /* qspi_config_t exposes no CPOL/CPHA fields and the public SDK has no
   * runtime mode setter.  The BK7258 QSPI reset/default mode is mode 0.
   */

  FAR struct bk7258_qspi_priv_s *priv =
    (FAR struct bk7258_qspi_priv_s *)dev;

  priv->mode = mode;
  priv->mode_valid = mode == QSPIDEV_MODE0;
}

/****************************************************************************
 * Name: bk7258_qspi_setbits
 ****************************************************************************/

static void bk7258_qspi_setbits(FAR struct qspi_dev_s *dev, int nbits)
{
  /* qspi_cmd_t is byte-oriented; the SDK has no word-width setter. */

  FAR struct bk7258_qspi_priv_s *priv =
    (FAR struct bk7258_qspi_priv_s *)dev;

  priv->bits = nbits;
  priv->bits_valid = nbits == 8;
}

/****************************************************************************
 * Name: bk7258_qspi_init_locked
 ****************************************************************************/

static int bk7258_qspi_init_locked(FAR struct bk7258_qspi_priv_s *priv)
{
  qspi_config_t config;
  bk_err_t error;

  if (priv->initialized)
    {
      return OK;
    }

  /* The SDK driver resource is global and idempotent.  Always repeat this
   * public init before a per-unit init: an external SDK deinit can make a
   * cached wrapper state stale, while the SDK call itself is safe to repeat.
   * There is deliberately no matching global deinit: the SDK state is shared
   * with other AP clients and NuttX QSPI has no ownership-safe shutdown
   * callback.
   */

  error = bk_qspi_driver_init();
  if (error != BK_OK)
    {
      return bk7258_qspi_map_error(error);
    }

  /* Match the v3.1.1.9 bk_qspi_flash_init() controller configuration without
   * selecting a Flash vendor, QE policy, address map, or command set.
   */

  config.src_clk     = QSPI_SCLK_480M;
  config.src_clk_div = 0x4;
  config.clk_div     = 0x2;

  error = bk_qspi_init(priv->id, &config);
  if (error != BK_OK)
    {
      /* bk_qspi_init() returns before changing hardware for its documented
       * parameter/driver-not-init errors.  Do not deinit the shared SDK
       * driver here; another AP client may own it.
       */

      return bk7258_qspi_map_error(error);
    }

  priv->initialized = true;
  return OK;
}

/****************************************************************************
 * Name: bk7258_qspi_write_data
 ****************************************************************************/

static int bk7258_qspi_write_data(
                                  FAR struct bk7258_qspi_priv_s *priv,
                                  FAR const void *buffer,
                                  size_t buflen)
{
  FAR void *staged = NULL;
  bool allocated = false;
  size_t padded;
  bk_err_t error;
  int ret;

