open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_qspi.c
  if (buffer == NULL || buflen == 0 || buflen > BK7258_QSPI_FIFO_BYTES)
    {
      return -EINVAL;
    }

  if ((((uintptr_t)buffer & (BK7258_QSPI_WORD_BYTES - 1u)) == 0) &&
      ((buflen & (BK7258_QSPI_WORD_BYTES - 1u)) == 0))
    {
      staged = (FAR void *)buffer;
    }
  else
    {
      if (buflen > SIZE_MAX - (BK7258_QSPI_WORD_BYTES - 1u))
        {
          return -EOVERFLOW;
        }

      padded = (buflen + (BK7258_QSPI_WORD_BYTES - 1u)) &
               ~(BK7258_QSPI_WORD_BYTES - 1u);
      staged = kmm_malloc(padded);
      if (staged == NULL)
        {
          return -ENOMEM;
        }

      memset(staged, 0, padded);
      memcpy(staged, buffer, buflen);
      allocated = true;
    }

  error = bk_qspi_write(priv->id, staged, (uint32_t)buflen);
  ret = bk7258_qspi_map_priv_error(priv, error);

  if (allocated)
    {
      kmm_free(staged);
    }

  return ret;
}

/****************************************************************************
 * Name: bk7258_qspi_read_data
 ****************************************************************************/

static int bk7258_qspi_read_data(
                                 FAR struct bk7258_qspi_priv_s *priv,
                                 FAR void *buffer,
                                 size_t buflen)
{
  FAR void *staged = NULL;
  bool allocated = false;
  size_t padded;
  bk_err_t error;
  int ret;

  if (buffer == NULL || buflen == 0 || buflen > BK7258_QSPI_FIFO_BYTES)
    {
      return -EINVAL;
    }

  if ((((uintptr_t)buffer & (BK7258_QSPI_WORD_BYTES - 1u)) == 0) &&
      ((buflen & (BK7258_QSPI_WORD_BYTES - 1u)) == 0))
    {
      staged = buffer;
    }
  else
    {
      if (buflen > SIZE_MAX - (BK7258_QSPI_WORD_BYTES - 1u))
        {
          return -EOVERFLOW;
        }

      padded = (buflen + (BK7258_QSPI_WORD_BYTES - 1u)) &
               ~(BK7258_QSPI_WORD_BYTES - 1u);
      staged = kmm_malloc(padded);
      if (staged == NULL)
        {
          return -ENOMEM;
        }

      allocated = true;
    }

  error = bk_qspi_read(priv->id, staged, (uint32_t)buflen);
  ret = bk7258_qspi_map_priv_error(priv, error);

  if (ret >= 0 && allocated)
    {
      memcpy(buffer, staged, buflen);
    }

  if (allocated)
    {
      kmm_free(staged);
    }

  return ret;
}

/****************************************************************************
 * Name: bk7258_qspi_no_address_command
 ****************************************************************************/

static bool bk7258_qspi_no_address_command(uint32_t opcode, bool read)
{
  if (read)
    {
      return opcode == BK7258_QSPI_CMD_READ_STATUS_0 ||
             opcode == BK7258_QSPI_CMD_READ_STATUS_1 ||
             opcode == BK7258_QSPI_CMD_READ_ID;
    }

  return opcode == BK7258_QSPI_CMD_WRITE_STATUS_0 ||
         opcode == BK7258_QSPI_CMD_WRITE_STATUS_1 ||
         opcode == BK7258_QSPI_CMD_WRITE_ENABLE;
}

/****************************************************************************
 * Name: bk7258_qspi_is_status_write
 ****************************************************************************/

static bool bk7258_qspi_is_status_write(uint32_t opcode)
{
  return opcode == BK7258_QSPI_CMD_WRITE_STATUS_0 ||
         opcode == BK7258_QSPI_CMD_WRITE_STATUS_1;
}

/****************************************************************************
 * Name: bk7258_qspi_command
 ****************************************************************************/

static int bk7258_qspi_command(FAR struct qspi_dev_s *dev,
                               FAR struct qspi_cmdinfo_s *cmdinfo)
{
  FAR struct bk7258_qspi_priv_s *priv =
    (FAR struct bk7258_qspi_priv_s *)dev;
  qspi_cmd_t command;
  FAR const uint8_t *status_data;
  uint8_t data_flags;
  bool encoded_status_write = false;
  bk_err_t error;
  int ret;

  if (cmdinfo == NULL)
    {
      return -EINVAL;
    }

  ret = bk7258_qspi_validate_config(priv);
  if (ret < 0)
    {
      return ret;
    }

  if ((cmdinfo->flags & ~(QSPICMD_ADDRESS | QSPICMD_READDATA |
                          QSPICMD_WRITEDATA | QSPICMD_IDUAL |
                          QSPICMD_IQUAD)) != 0)
    {
      return -EINVAL;
    }

  data_flags = cmdinfo->flags & (QSPICMD_READDATA | QSPICMD_WRITEDATA);
  if (data_flags == (QSPICMD_READDATA | QSPICMD_WRITEDATA))
    {
      return -EINVAL;
    }

  if (cmdinfo->cmd > BK7258_QSPI_OPCODE_MAX)
    {
      return -ENOTSUP;
    }

  if ((cmdinfo->flags & (QSPICMD_IDUAL | QSPICMD_IQUAD)) != 0)
    {
      /* qspi_cmd_t selects the data lines only; the SDK cannot express a
       * separate dual/quad instruction line.
       */

      return -ENOTSUP;
    }

  if (cmdinfo->buflen > BK7258_QSPI_FIFO_BYTES)
    {
      /* A command is one chip-select transaction; it cannot be split here. */

      return -E2BIG;
    }

  if (data_flags != 0 &&
      (cmdinfo->buflen == 0 || cmdinfo->buffer == NULL))
    {
      return -EINVAL;
    }

  if (QSPICMD_ISADDRESS(cmdinfo->flags))
    {
      if (bk7258_qspi_no_address_command(cmdinfo->cmd,
                                         QSPICMD_ISREAD(cmdinfo->flags)))
        {
          /* These SDK encodings intentionally omit the address. */

          return -ENOTSUP;
        }

      if (cmdinfo->addrlen != 3)
        {
          /* BK7258 qspi_ll_init_command() always emits exactly 3 address
           * bytes for QSPI_FLASH indirect commands.
           */

          return -ENOTSUP;
        }

      if (cmdinfo->addr > BK7258_QSPI_ADDRESS_MASK)
        {
          return -EOVERFLOW;
        }
    }
  else if (cmdinfo->addrlen != 0 || cmdinfo->addr != 0)
    {
      return -EINVAL;
    }
  else if (!bk7258_qspi_no_address_command(
             cmdinfo->cmd, QSPICMD_ISREAD(cmdinfo->flags)))
    {
      /* For every other opcode the immutable SDK emits three address bytes
       * even when NuttX requested none.  Refuse that mismatch instead of
       * silently putting an unintended address on the bus.
       */

      return -ENOTSUP;
    }

  if (cmdinfo->cmd == BK7258_QSPI_CMD_WRITE_ENABLE &&
      QSPICMD_ISDATA(cmdinfo->flags))
    {
      return -EINVAL;
    }

