open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_qspi.c
  if (!priv->initialized)
    {
      /* QSPI upper-half callers hold g_bk7258_qspi_lock around command
       * sequences.  Retry an SDK/per-unit initialization that was
       * unavailable earlier or was invalidated by a shared-client deinit.
       */

      ret = bk7258_qspi_init_locked(priv);
      if (ret < 0)
        {
          return ret;
        }
    }

  memset(&command, 0, sizeof(command));
  command.device    = QSPI_FLASH;
  command.work_mode = INDIRECT_MODE;
  command.op        = QSPICMD_ISREAD(cmdinfo->flags) ? QSPI_READ : QSPI_WRITE;
  command.cmd       = cmdinfo->cmd;
  command.addr      = cmdinfo->addr;
  command.data_len  = cmdinfo->buflen;
  command.wire_mode = QSPI_1WIRE;

  /* qspi_ll_init_command() implements WRSR/WRVSR specially: the status byte
   * is carried in qspi_cmd_t.cmd[15:8], and the command has no FIFO payload.
   * Adapt the standard NuttX write-data form to that immutable SDK encoding
   * so MTD status-register writes retain their normal semantics.  The SDK's
   * second status-byte form is selected only when cmd[23:16] is nonzero, so
   * it cannot represent a two-byte value whose high byte is zero without
   * changing the data on the wire; reject multi-byte requests here.
   */

  if (QSPICMD_ISWRITE(cmdinfo->flags) &&
      bk7258_qspi_is_status_write(cmdinfo->cmd))
    {
      if (cmdinfo->buflen > 1)
        {
          return -ENOTSUP;
        }

      status_data = (FAR const uint8_t *)cmdinfo->buffer;
      if (cmdinfo->buflen > 0)
        {
          command.cmd |= (uint32_t)status_data[0] << 8;
        }

      command.data_len = 0;
      encoded_status_write = true;
    }

  /* The SDK API requires write FIFO data before command start. */

  if (QSPICMD_ISWRITE(cmdinfo->flags) && !encoded_status_write)
    {
      ret = bk7258_qspi_write_data(priv, cmdinfo->buffer,
                                   cmdinfo->buflen);
      if (ret < 0)
        {
          return ret;
        }
    }

  error = bk_qspi_command(priv->id, &command);
  ret = bk7258_qspi_map_priv_error(priv, error);
  if (ret < 0)
    {
      return ret;
    }

  /* Read FIFO data is valid after the synchronous command completes. */

  if (QSPICMD_ISREAD(cmdinfo->flags))
    {
      ret = bk7258_qspi_read_data(priv, cmdinfo->buffer,
                                  cmdinfo->buflen);
    }

  return ret;
}

/****************************************************************************
 * Name: bk7258_qspi_validate_memory
 ****************************************************************************/

static int bk7258_qspi_validate_memory(FAR const struct qspi_meminfo_s *meminfo,
                                       qspi_wire_mode_t *wire_mode)
{
  if (meminfo == NULL || wire_mode == NULL || meminfo->buffer == NULL ||
      meminfo->buflen == 0)
    {
      return -EINVAL;
    }

  if ((meminfo->flags & ~(QSPIMEM_WRITE | QSPIMEM_DUALIO |
                          QSPIMEM_QUADIO | QSPIMEM_SCRAMBLE |
                          QSPIMEM_RANDOM | QSPIMEM_IDUAL |
                          QSPIMEM_IQUAD)) != 0)
    {
      return -EINVAL;
    }

  if (meminfo->cmd > BK7258_QSPI_OPCODE_MAX)
    {
      return -ENOTSUP;
    }

  if (bk7258_qspi_no_address_command(meminfo->cmd,
                                     QSPIMEM_ISREAD(meminfo->flags)))
    {
      /* qspi_meminfo_s describes an addressed memory operation here. */

      return -ENOTSUP;
    }

  if (meminfo->addrlen != 3)
    {
      /* The BK7258 SDK QSPI_FLASH path has no 4-byte address mode. */

      return -ENOTSUP;
    }

  if (meminfo->addr > BK7258_QSPI_ADDRESS_MASK ||
      meminfo->buflen > BK7258_QSPI_ADDRESS_LIMIT - meminfo->addr)
    {
      return -EOVERFLOW;
    }

  if (meminfo->dummies > BK7258_QSPI_DUMMY_MAX)
    {
      return -ENOTSUP;
    }

  if (QSPIMEM_ISWRITE(meminfo->flags) &&
      meminfo->buflen > BK7258_QSPI_FIFO_BYTES)
    {
      /* A write must remain one chip-select/FIFO transaction.  Splitting it
       * here would require a per-page WREN/WIP protocol that this generic
       * lower-half cannot infer from qspi_meminfo_s.
       */

      return -E2BIG;
    }

  if ((meminfo->flags & (QSPIMEM_SCRAMBLE | QSPIMEM_RANDOM)) != 0)
    {
      /* The public BK7258 qspi_cmd_t has no scrambler controls. */

      return -ENOTSUP;
    }

  if ((meminfo->flags & (QSPIMEM_IDUAL | QSPIMEM_IQUAD)) != 0)
    {
      /* Instruction width is not independently expressible in qspi_cmd_t. */

      return -ENOTSUP;
    }

  if (QSPIMEM_ISDUALIO(meminfo->flags))
    {
      /* BK7258 qspi_ll selects dual data lines only as part of a command
       * encoding that is not the NuttX DUALIO address/data contract.
       */

      return -ENOTSUP;
    }

  if (QSPIMEM_ISWRITE(meminfo->flags) &&
      QSPIMEM_ISQUADIO(meminfo->flags))
    {
      /* NuttX defines DUALIO/QUADIO as read transfer modes. */

      return -EINVAL;
    }

  *wire_mode = QSPIMEM_ISQUADIO(meminfo->flags) ? QSPI_4WIRE : QSPI_1WIRE;
  return OK;
}

/****************************************************************************
 * Name: bk7258_qspi_memory
 ****************************************************************************/

static int bk7258_qspi_memory(FAR struct qspi_dev_s *dev,
                              FAR struct qspi_meminfo_s *meminfo)
{
  FAR struct bk7258_qspi_priv_s *priv =
    (FAR struct bk7258_qspi_priv_s *)dev;
  FAR uint8_t *buffer;
  qspi_wire_mode_t wire_mode;
  qspi_cmd_t command;
  uint32_t offset = 0;
  uint32_t remaining;
  uint32_t chunk;
  bk_err_t error;
  int ret;

  ret = bk7258_qspi_validate_memory(meminfo, &wire_mode);
  if (ret < 0)
    {
      return ret;
    }

  ret = bk7258_qspi_validate_config(priv);
  if (ret < 0)
    {
      return ret;
    }

  if (!priv->initialized)
    {
      /* See bk7258_qspi_command(): the standard QSPI contract serializes
       * this path with lock(), allowing safe lazy retry under the mutex.
       */

      ret = bk7258_qspi_init_locked(priv);
      if (ret < 0)
        {
          return ret;
        }
    }

  buffer = (FAR uint8_t *)meminfo->buffer;
  remaining = meminfo->buflen;

  /* Writes were limited to one 256-byte transaction by validation above.
   * Reads alone may use multiple independently addressed transactions: each
   * chunk is a new, re-addressed read of a contiguous memory window, not one
   * persistent chip-select transaction.
   */

