open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/ap/bk7258_qspi.c
  while (remaining > 0)
    {
      chunk = remaining > BK7258_QSPI_FIFO_BYTES ?
              BK7258_QSPI_FIFO_BYTES : remaining;

      memset(&command, 0, sizeof(command));
      command.device     = QSPI_FLASH;
      command.work_mode  = INDIRECT_MODE;
      command.op         = QSPIMEM_ISREAD(meminfo->flags) ? QSPI_READ :
                           QSPI_WRITE;
      command.cmd        = meminfo->cmd;
      command.addr       = meminfo->addr + offset;
      command.dummy_cycle = meminfo->dummies;
      command.data_len   = chunk;
      command.wire_mode  = wire_mode;

      if (QSPIMEM_ISWRITE(meminfo->flags))
        {
          ret = bk7258_qspi_write_data(priv, buffer + offset, chunk);
          if (ret < 0)
            {
              return ret;
            }
        }

      error = bk_qspi_command(priv->id, &command);
      ret = bk7258_qspi_map_priv_error(priv, error);
      if (ret < 0)
        {
          return ret;
        }

      if (QSPIMEM_ISREAD(meminfo->flags))
        {
          ret = bk7258_qspi_read_data(priv, buffer + offset, chunk);
          if (ret < 0)
            {
              return ret;
            }
        }

      offset += chunk;
      remaining -= chunk;
    }

  return OK;
}

/****************************************************************************
 * Name: bk7258_qspi_alloc
 ****************************************************************************/

static FAR void *bk7258_qspi_alloc(FAR struct qspi_dev_s *dev,
                                   size_t buflen)
{
  size_t padded;

  (void)dev;

  if (buflen == 0 || buflen > SIZE_MAX - (BK7258_QSPI_WORD_BYTES - 1u))
    {
      return NULL;
    }

  padded = (buflen + (BK7258_QSPI_WORD_BYTES - 1u)) &
           ~(BK7258_QSPI_WORD_BYTES - 1u);
  return kmm_malloc(padded);
}

/****************************************************************************
 * Name: bk7258_qspi_free
 ****************************************************************************/

static void bk7258_qspi_free(FAR struct qspi_dev_s *dev, FAR void *buffer)
{
  (void)dev;
  if (buffer != NULL)
    {
      kmm_free(buffer);
    }
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: bk7258_qspi_initialize
 ****************************************************************************/

FAR struct qspi_dev_s *bk7258_qspi_initialize(int intf)
{
  FAR struct bk7258_qspi_priv_s *priv;
  int ret;

  if (intf < 0 || intf >= BK7258_QSPI_UNIT_COUNT)
    {
      return NULL;
    }

  priv = &g_bk7258_qspi[intf];

  ret = nxmutex_lock(&g_bk7258_qspi_lock);
  if (ret < 0)
    {
      return NULL;
    }

  ret = bk7258_qspi_init_locked(priv);
  nxmutex_unlock(&g_bk7258_qspi_lock);

  return ret < 0 ? NULL : &priv->dev;
}

#endif /* CONFIG_BK7258_QSPI */
